# pivot table

In [29]:
import numpy as np 
import pandas as pd

In [30]:

data = {
    'Emp_ID': range(1, 21),
    'Name': [
        'Amit','Rahul','Neha','Priya','Rohan',
        'Kiran','Sneha','Arjun','Pooja','Vikas',
        'Anita','Suresh','Meena','Ravi','Kavita',
        'Nikhil','Payal','Deepak','Isha','Manoj'
    ],
    'Department': [
        'IT','HR','IT','Finance','HR',
        'IT','Finance','IT','HR','Finance',
        'IT','HR','Finance','IT','HR',
        'Finance','IT','HR','Finance','IT'
    ],
    'City': [
        'Delhi','Mumbai','Delhi','Pune','Mumbai',
        'Delhi','Pune','Mumbai','Delhi','Pune',
        'Mumbai','Delhi','Pune','Delhi','Mumbai',
        'Delhi','Pune','Mumbai','Delhi','Pune'
    ],
    'Salary': [
        50000,42000,60000,70000,45000,
        65000,72000,58000,48000,75000,
        62000,46000,71000,64000,47000,
        73000,66000,49000,76000,68000
    ],
    'Experience': [
        2,3,5,7,4,
        6,8,5,3,9,
        6,4,8,5,3,
        9,6,4,10,7
    ]
}

df = pd.DataFrame(data)
df

    Emp_ID    Name Department    City  Salary  Experience
0        1    Amit         IT   Delhi   50000           2
1        2   Rahul         HR  Mumbai   42000           3
2        3    Neha         IT   Delhi   60000           5
3        4   Priya    Finance    Pune   70000           7
4        5   Rohan         HR  Mumbai   45000           4
5        6   Kiran         IT   Delhi   65000           6
6        7   Sneha    Finance    Pune   72000           8
7        8   Arjun         IT  Mumbai   58000           5
8        9   Pooja         HR   Delhi   48000           3
9       10   Vikas    Finance    Pune   75000           9
10      11   Anita         IT  Mumbai   62000           6
11      12  Suresh         HR   Delhi   46000           4
12      13   Meena    Finance    Pune   71000           8
13      14    Ravi         IT   Delhi   64000           5
14      15  Kavita         HR  Mumbai   47000           3
15      16  Nikhil    Finance   Delhi   73000           9
16      17   Payal         IT    Pune   66000           6
17      18  Deepak         HR  Mumbai   49000           4
18      19    Isha    Finance   Delhi   76000          10
19      20   Manoj         IT    Pune   68000           7

In [ ]:
pd.pivot_table(df,values='Salary',index='City',columns='Department',aggfunc='max')

Department  Finance       HR       IT
City
Delhi       76000.0  48000.0  65000.0
Mumbai          NaN  49000.0  62000.0
Pune        75000.0      NaN  68000.0

In [33]:
pd.crosstab(df['Department'],df['City'])

City        Delhi  Mumbai  Pune
Department
Finance         2       0     4
HR              2       4     0
IT              4       2     2